//В этом задании у вас есть некоторый рабочий код, который закомментирован. 
//Вам нужно убрать все команды комментариев, чтобы код заработал, и нажать кнопку "Отправить".
function testComment(a, b) {
    return a*b;
}
//В указанное место напишите код, который поместит значение из переменной a в переменную x.
function testA(a){
    let x=a;
    return x;
}
//В этом задании вам нужно вписать в указанное место код, который будет присваивать переменной "х" 
//значение суммы переменных "a" и "b". Указанные ниже Sample Input (образец входных данных) и Sample Output 
//(образец выходных данных) - это пример. Они показывают, что при значениях переменных "a" и "b" 
//как в Sample Input, например 2 и 8, ваш результат должен быть такой, как указано в Sample Output. 
//Например, если Sample Input равен 2 и 8, то Sample Output должен быть 10, т.е. сумма первой и второй переменных.
function testSum(a, b) {
    let x = a + b
    return x;
}
//В этом задании вам нужно вписать в указанное место код, который будет присваивать переменной "х" 
//удвоенное значение остатка от деления произведения переменных "a" и "b" на их сумму.
function testOperation(a, b) {
    let x = a*b%(a+b)*2
    return x;
}
//В этом задании вам нужно вписать в указанное место код, который будет присваивать переменной "х" 
//значение суммы переменных "a" и "b" в случае если  a > b или их произведение в остальных случаях.
function testIf(a, b) {
    let x;
    if (a > b) {
        x = a + b
    } else {x = a * b}
    return x
}
//В этом задании вам нужно вписать в указанное место код, который будет присваивать переменной "х" значение суммы 
//переменных "a" и "b" - в случае если  a < b, разность "a" и "b" - в случае если  a > b, и их произведение  
//в остальных случаях.
function testIf(a, b) {
    var x;
    if(a < b) {
        x = a + b
    }else if (a > b) {
        x = a - b
    } else {x = a * b}
        return x
}
//В этом задании вам нужно вписать в указанное место код, который будет присваивать переменной "х" название цифры, 
//переданной в переменную "а". Цифра в переменную "а" будет передана случайным образом и может оказаться в диапазоне 
//от 0 до 9 включительно, название должно быть написано по-русски с большой буквы - "Ноль", "Один", "Два" и т.д.
function testCase(a) {
    var x;
    switch (a) {
        case 0:
            x = "Ноль";
            break;
        case 1:
            x = "Один";
            break;
        case 2:
            x = "Два";
            break;
        case 3:
            x = "Три";
            break;
        case 4:
            x = "Четыре";
            break; 
        case 5:
            x = "Пять";
            break;            
        case 6:
            x = "Шесть";
            break;            
        case 7:
            x = "Семь";
            break;            
        case 8:
            x = "Восемь";
            break;            
        case 9:
            x = "Девять";
            break;
        default:
            x = "Что то пошло не так";
    }
    return x;
}
//Дано натуральное число n. Напишите рекурсивную функцию, которая возвращает строку чисел от 1 до n, разделенных пробелом.
function my_function(n) {
    if (n==1) return n;
    else return my_function(n - 1) + ' ' + n;
}
//В этом задании вам нужно вычислить факториал для числа, передаваемого в нашу функцию и вывести его с помощью команды 
//return. На всякий случай напоминаем, что факториал числа a это произведение всех целых чисел от 1 до a, например, 
//если а = 5, то факториал a будет равен 1 * 2 * 3 * 4 * 5
function testFactorial(a) {
    for (var i = 1; i <= a; i++) {
        x = x * i}
    return x;
}
//В этом задании вам нужно вычислить сумму всех четных чисел, встречающихся в ряду от 1 до числа (включительно), 
//передаваемого в нашу функцию (переменная "а").
function testWhile(a) {
    let x=0;
    let y=0;
    while(y<=a){
        if(y%2==0){x=x+y};
        y = y+1;
        }
    return x;
}
//В этом задании в нашу функцию testStr передаются две строки. Вам нужно вернуть из функции их суммарную длину.
function testStr(a, b) {
    return((a+b).length) 
}
//В этом задании в нашу функцию testStr первым параметром передается строка (переменная str), 
//а вторым - число (переменная n) . Вам нужно вернуть из функции символ строки , 
//порядковый номер которого указан в переданном в функцию числе.
function testStr(str, n) {
    return (str.charAt(n-1))
}
//В этом задании в нашу функцию testStr передаются две строки. Вам нужно вернуть из функции строку, 
//которая будет включать в себя обе этих строки, преобразовав в первой строке все буквы в заглавные, 
//а во второй - в строчные.
function testStr(a, b) {
    return((a.toUpperCase()).concat(b.toLowerCase()))
}
//В этом задании в нашу функцию testStr передаются две строки. 
//Вам нужно вернуть индекс позиции, с которой начинается вхождение второй строки в первую.
function testStr(a, b) {
    return a.indexOf(b);
}
//В этом задании в нашу функцию testArray передаются два массива случайной длины заполненные случайными числами. 
//Вам нужно сосчитать сумму всех элементов обоих массивов и возвратить ее из функции.
function testArray(a, b) {
    let sum1 = 0;
    let sum2 = 0;
    for(let i=0; i<a.length; i++){sum1 += a[i]};
    for(let i=0; i<b.length; i++){sum2 += b[i]};    
    return(sum1+ sum2)
}

//В этом задании в нашу функцию testArray передаются две строки случайной длины и содержания. 
//Вам нужно составить из символов этих строк один массив (каждый символ строки становится отдельным элементом массива), 
//затем добавить первым элементом  массива текстовое значение "Иванов", 
//и вернуть из функции все элементы в обратном порядке, преобразовав в строку. Обратите внимание, 
//что в обратном порядке нужно переставить элементы внутри массива, а данные внутри элементов инвертировать не нужно!

function testArray(a, b) {
    let mystring = a+b
    let myarray = mystring.split("")
    myarray.unshift("Иванов")
    myarray = myarray.reverse();
    mystring = myarray.join("")
    return mystring
}
//В этом задании в нашу функцию testDateTime передаются две строки вида "03 November 2017 04:17".
//Вам нужно превратить строки в даты, сравнить их. Для той, что больше получить день недели и вернуть его из функции.
//Название дня недели должно быть по-русски, с большой буквы, например: "Понедельник".

function testDateTime(a, b){
    let dateA = new Date (a);
    let dateB = new Date (b);
    let day;
    let week = ["Воскресенье","Понедельник","Вторник","Среда","Четверг","Пятница","Суббота"]
    if(dateA >= dateB){day = dateA.getDay()}
    else{day = dateB.getDay()}
    return week[day]
}
//В этом задании в нашу функцию передается угол в градусах. 
//Вам нужно вернуть из функции значение его синуса. Не забывайте, 
//что тригонометрические функции в JavaScript принимают аргументы только в радианах!
function testMath(a){
    return Math.sin (a*Math.PI/180)
}
//А тут вам нужно вычислить и вернуть из функции площадь треугольника. 
//Передаваемые в функцию аргументы "a" и "b" - это длины сторон, а "c" - это угол между ними в градусах.
function testMath(a, b, c) {
    // Тут нужно написать решение
    return 1/2*a*b*Math.sin(c*Math.PI/180)
}
//В этом задании в нашу функцию передаются 4 числа. 
//Вам необходимо вычислить результат деления большего из этих чисел на меньшее, 
//и округлив до ближайшего меньшего целого вернуть из функции.
function testMath(a, b, c, d) {
    return Math.floor(Math.max(a,b,c,d)/Math.min(a,b,c,d))
}
//В этом задании вам необходимо выполнить возведение переменной a в степень b и возврат значения из функции.
function testMath(a, b) {
    return Math.pow(a,b)
}
//В этом задании в нашу функцию передаются два параметра: целочисленная переменная ("а") и некоторая функция ("func"). 
//Вам необходимо запустить функцию "func", с переменной "а" в качестве аргумента. Но вот проблема - в функции, похоже, 
//оказалась ошибка. Вам нужно возвратить имя (свойство "name") возникающей ошибки.
function testErrorFunc(a, func) {         
    try{
        func(a)
    }catch(x){
    return x.name
}}
//В этом задании в нашу функцию testRegExp первым параметром передается случайная строка(переменная s), 
//а вторым - случайная подстрока(переменная sub_s), которую нужно использовать в качестве шаблона регулярного выражения. 
//Вам нужно вернуть из функции строку, в которой будут перечислены через запятую все совпадения шаблона с первой строкой.
function testRegExp(s, sub_s) {
    sub_s = new RegExp(sub_s,"g");
    let result = s.match(sub_s);
    return result.join()
}